# DimensionWithoutParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..DimensionWithoutParameter Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Dimension has no parameter assigned to it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionWithoutParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionWithoutParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionWithoutParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace